resources/public/presentations/latest-news/latest-news.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>April 2012 Clojure News</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-04 18:50:40 CDT"/>
<meta name="author" content="Ben Peirce"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="common.css" />
<link rel="stylesheet" type="text/css" href="screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="presenter.css" media="presenter" />


</head>
<body>
<div id="content">

<h1 class="title">April 2012 Clojure News</h1>

<p>Type <strong>T</strong> to begin the slide show.</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">April News</a></li>
<li><a href="#sec-2">Playing with other languages</a></li>
<li><a href="#sec-3">New Libraries</a></li>
<li><a href="#sec-4">Other new Projects</a></li>
<li><a href="#sec-5">Talks and articles</a></li>
<li><a href="#sec-6">Instruction</a>
<ul>
<li><a href="#sec-6_1">The End</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2"></span> April News &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">


<ul>
<li id="sec-1_1"><a href="http://paper.li/ajlopez/1291580164">The Clojure Daily</a> <br/>

</li>
</ul>
<ul>
<li id="sec-1_2"><a href="http://bits.blogs.nytimes.com/2012/04/03/prismatic-hopes-to-offer-a-new-category-of-social-news/">Prismatic Hopes to Create a New Category of Social News</a> <br/>
     See also <a href="https://github.com/strangeloop/clojurewest2012-slides/blob/master/Cross-Prismatic.pdf">Why Prismatic Goes Faster With Clojure</a> from Strange Loop .

</li>
</ul>
<ul>
<li id="sec-1_3"><a href="http://www.clojurebook.com/">Clojure Programming</a> ships this month. <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2"></span> Playing with other languages &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">


<ul>
<li id="sec-2_1"><a href="https://github.com/halgari/clojure-py">clojure-py</a> <br/>
     "An implementation of Clojure in pure Python"

</li>
</ul>
<ul>
<li id="sec-2_2"><a href="https://github.com/takeoutweight/clojure-scheme">clojure-scheme</a> <br/>
     "Clojure to Scheme to C to the bare metal."

</li>
</ul>
<ul>
<li id="sec-2_3"><a href="https://github.com/headius/cloby">Cloby</a> <br/>
     "A Clojure Ref/STM plugin for JRuby." Not new, but I just saw
     this.

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2"></span> New Libraries &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">


<ul>
<li id="sec-3_1"><a href="https://github.com/clojurewerkz/mailer">Clojurewerkz Mailer</a> <br/>
     "An ActionMailer-inspired mailer library. Combines Postal,
     Clostache, some conventions and support for multiple delivery
     modes"

</li>
</ul>
<ul>
<li id="sec-3_2"><a href="http://pelle.github.com/clauth/">Clauth</a> <br/>
     "OAuth 2 based simple authentication system for Clojure Ring"

</li>
</ul>
<ul>
<li id="sec-3_3"><a href="http://budu.github.com/lobos/index.html">Lobos</a> <br/>
     "Lobos is a library to help you create and modify database
     schemas using Clojure code."

</li>
</ul>
<ul>
<li id="sec-3_4"><a href="https://github.com/liquidz/misaki">Misaki</a> <br/>
     "Jekyll inspired static site generator in Clojure"

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2"></span> Other new Projects &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">


<ul>
<li id="sec-4_1"><a href="http://himera.herokuapp.com/index.html">Himera</a> <br/>
     "ClojureScript compiler as web service."
<ul>
<li id="sec-4_1_1">See <a href="http://blog.fogus.me/2012/03/27/compiling-clojure-to-javascript-pt-3-the-himera-model/">Compiling Clojure to JavaScript, pt. 3 – The Himera Model</a> <br/>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-4_2"><a href="https://github.com/rplevy/swiss-arrows">swiss-arrows</a> <br/>
     "A collection of arrow macros."

</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2"></span> Talks and articles &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">


<ul>
<li id="sec-5_1"><a href="http://www.scribd.com/doc/32281187/Asynchronous-concurrency-in-Clojure-and-a-few-other-languages">Asysnchronous Concurrency in Clojure</a> <br/>

</li>
</ul>
<ul>
<li id="sec-5_2"><a href="http://www.ibm.com/developerworks/java/library/j-couchdb-clojure/index.html?ca=drs-">Using CouchDB with Clojure</a> <br/>


</li>
</ul>
<ul>
<li id="sec-5_3"><a href="http://www.clojure.net/2012/03/24/Continuation-monad/">Continuation Monad</a> <br/>

</li>
</ul>
<ul>
<li id="sec-5_4"><a href="http://www.javaworld.com/javaworld/jw-03-2012/120322-clojure-inventor-aims-for-android.html?source=IFWNLE_jw_2012-03-27">Clojure inventor Hickey now aims for Android</a> <br/>

</li>
</ul>
<ul>
<li id="sec-5_5"><a href="http://blog.incubaid.com/2012/03/28/the-game-of-distributed-systems-programming-which-level-are-you/">The Game of Distributed Systems Programming. Which Level Are You?</a> <br/>

</li>
</ul>
<ul>
<li id="sec-5_6"><a href="http://www.infoq.com/interviews/hickey-datomic">Rich Hickey on Datomic: Datalog, Databases, Persistent Data Structures</a> <br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2"></span> Instruction &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">


<ul>
<li id="sec-6_1"><a href="http://codelesson.com/courses/view/introduction-to-clojure">Introduction To Clojure</a> <br/>
     "The Clojure programming language, from Lisp roots, to JVM ubiquity"

</li>
</ul>
<ul>
<li id="sec-6_2"><a href="http://www.codeschool.com/code_tv/getting-started-with-clojure-part-1">Getting Started with Clojure</a> at Code School <br/>

</li>
</ul>
<ul>
<li id="sec-6_3"><a href="http://www.elangocheran.com/blog/2012/03/the-newbies-guide-learning-clojure/">The Newbie’s Guide to Learning Clojure</a> <br/>

</li>
</ul>
<ul>
<li id="sec-6_4"><a href="http://www.unexpected-vortices.com/clojure/brief-beginners-guide/">A Brief Beginner's Guide To Clojure</a> <br/>



</li>
</ul>

</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3"></span> The End &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-6_1">


<ul>
<li id="sec-6_1_1"><a href="https://github.com/relevance/org-html-slideshow">org-HTML-slideshow</a> <br/>
     Library to turn org-mode HTML exports into presentations.
     Written in ClojureScript.





<script type="text/javascript" src="org-html-slideshow.js"></script>

</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="date">Date: 2012-04-04 18:50:40 CDT</p>
<p class="author">Author: Ben Peirce</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
